jin04151/SmartHomeSafety_stm32-uC-OS3/app.c
    OSQCreate(&AppEventQ,
              "Event Queue",
              APP_EVENT_Q_SIZE,
              &err);

    OSMutexCreate(&AppModeMutex,
                  "Mode Mutex",
                  &err);

    AppMode = APP_MODE_HOME;
    AppPrevMode = APP_MODE_HOME;
    AppEmergencyReason = APP_EMG_NONE;
    AppEmergencyActive = DEF_FALSE;
    AppPirDetected = DEF_FALSE;

    AppEventWrIx = 0u;

    AppGasCount = 0u;
    AppFlameCount = 0u;
    AppPirCount = 0u;
    AppButtonCount = 0u;
    AppCommandCount = 0u;
}

/* ---------------- Task create ---------------- */
static void AppTaskCreate(void)
{
    OS_ERR err;

    OSTaskCreate(&AppTaskEmergencyTCB,
                 "Emergency Task",
                 AppTaskEmergency,
                 0,
                 APP_CFG_EMERGENCY_TASK_PRIO,
                 &AppTaskEmergencyStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskSecurityTCB,
                 "Security Task",
                 AppTaskSecurity,
                 0,
                 APP_CFG_SECURITY_TASK_PRIO,
                 &AppTaskSecurityStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskInputTCB,
                 "Input Task",
                 AppTaskInput,
                 0,
                 APP_CFG_INPUT_TASK_PRIO,
                 &AppTaskInputStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskStateTCB,
                 "State Task",
                 AppTaskState,
                 0,
                 APP_CFG_STATE_TASK_PRIO,
                 &AppTaskStateStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskUsartTCB,
                 "USART Task",
                 AppTaskUsart,
                 0,
                 APP_CFG_USART_TASK_PRIO,
                 &AppTaskUsartStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskOutputTCB,
                 "Output Task",
                 AppTaskOutput,
                 0,
                 APP_CFG_OUTPUT_TASK_PRIO,
                 &AppTaskOutputStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskMonitorTCB,
                 "Monitor Task",
                 AppTaskMonitor,
                 0,
                 APP_CFG_MONITOR_TASK_PRIO,
                 &AppTaskMonitorStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);
}

/* ---------------- GPIO / EXTI ---------------- */
static void AppGpioInit(void)
{
    GPIO_InitTypeDef gpio;

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA |
                       RCC_AHB1Periph_GPIOB |
                       RCC_AHB1Periph_GPIOC |
                       RCC_AHB1Periph_GPIOD |
                       RCC_AHB1Periph_GPIOE |
                       RCC_AHB1Periph_GPIOF,
                       ENABLE);

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG,
                           ENABLE);

    /*
     * LED output
     */
    gpio.GPIO_Mode  = GPIO_Mode_OUT;
    gpio.GPIO_OType = GPIO_OType_PP;
    gpio.GPIO_Speed = GPIO_Speed_2MHz;
    gpio.GPIO_PuPd  = GPIO_PuPd_NOPULL;

    /* Power LED: PB8, PB9 */
    gpio.GPIO_Pin = POWER_LED_CUT_RED_PIN |
                    POWER_LED_NORMAL_GREEN_PIN;
    GPIO_Init(POWER_LED_GPIO_PORT, &gpio);

    /* Gas LED: PA6, PA7 */
    gpio.GPIO_Pin = GAS_LED_CUT_RED_PIN |
                    GAS_LED_NORMAL_GREEN_PIN;
    GPIO_Init(GAS_LED_GPIO_PORT, &gpio);

    /*
     * Buzzer output
     */
    gpio.GPIO_Pin = BUZZER_GPIO_PIN;
    GPIO_Init(BUZZER_GPIO_PORT, &gpio);

    /*
     * Sensor inputs
     */
    gpio.GPIO_Mode  = GPIO_Mode_IN;
    gpio.GPIO_OType = GPIO_OType_PP;
    gpio.GPIO_Speed = GPIO_Speed_2MHz;

    /*
     * GAS: D8 / PF12
     * 테스트 중 선을 뺐을 때 floating 방지용 풀다운
     */
    gpio.GPIO_PuPd = GPIO_PuPd_DOWN;
    gpio.GPIO_Pin  = GAS_GPIO_PIN;
    GPIO_Init(GAS_GPIO_PORT, &gpio);

    /*
    * FLAME: D2 / PF15
    * 테스트 중 선을 뺐을 때 floating 방지
    */
    gpio.GPIO_PuPd = GPIO_PuPd_DOWN;
    gpio.GPIO_Pin  = FLAME_GPIO_PIN;
    GPIO_Init(FLAME_GPIO_PORT, &gpio);

    /*
     * PIR: D4 / PF14
     * OUT 선을 뺐을 때 floating 방지
     */
    gpio.GPIO_PuPd = GPIO_PuPd_DOWN;
    gpio.GPIO_Pin  = PIR_GPIO_PIN;
    GPIO_Init(PIR_GPIO_PORT, &gpio);

    /*
     * User button input: PC13
     */
    gpio.GPIO_Mode  = GPIO_Mode_IN;
    gpio.GPIO_PuPd  = GPIO_PuPd_DOWN;
    gpio.GPIO_Pin   = BTN_GPIO_PIN;
    GPIO_Init(BTN_GPIO_PORT, &gpio);

    /* 초기 HOME 상태:
     * 전력 정상 초록 ON
     * 가스 정상 초록 ON
     * 차단 빨강들은 OFF
     */
    GPIO_ResetBits(POWER_LED_GPIO_PORT, POWER_LED_CUT_RED_PIN);
    GPIO_SetBits  (POWER_LED_GPIO_PORT, POWER_LED_NORMAL_GREEN_PIN);

    GPIO_ResetBits(GAS_LED_GPIO_PORT, GAS_LED_CUT_RED_PIN);
    GPIO_SetBits  (GAS_LED_GPIO_PORT, GAS_LED_NORMAL_GREEN_PIN);

    GPIO_ResetBits(BUZZER_GPIO_PORT, BUZZER_GPIO_PIN);
}

static void AppExtiInit(void)
{
    EXTI_InitTypeDef exti;

    SYSCFG_EXTILineConfig(GAS_EXTI_PORT_SRC,
                          GAS_EXTI_PIN_SRC);

