jin04151/SmartHomeSafety_stm32-uC-OS3/app.c
    SYSCFG_EXTILineConfig(FLAME_EXTI_PORT_SRC,
                          FLAME_EXTI_PIN_SRC);

    SYSCFG_EXTILineConfig(PIR_EXTI_PORT_SRC,
                          PIR_EXTI_PIN_SRC);

    SYSCFG_EXTILineConfig(BTN_EXTI_PORT_SRC,
                          BTN_EXTI_PIN_SRC);

    EXTI_ClearITPendingBit(GAS_EXTI_LINE |
                           FLAME_EXTI_LINE |
                           PIR_EXTI_LINE |
                           BTN_EXTI_LINE);

    exti.EXTI_Mode    = EXTI_Mode_Interrupt;
    exti.EXTI_Trigger = EXTI_Trigger_Rising;
    exti.EXTI_LineCmd = ENABLE;

    exti.EXTI_Line = GAS_EXTI_LINE;
    EXTI_Init(&exti);

    exti.EXTI_Line = FLAME_EXTI_LINE;
    EXTI_Init(&exti);

    exti.EXTI_Line = PIR_EXTI_LINE;
    EXTI_Init(&exti);

    exti.EXTI_Trigger = EXTI_Trigger_Falling;
    exti.EXTI_Line    = BTN_EXTI_LINE;
    EXTI_Init(&exti);

    BSP_IntVectSet(BSP_INT_ID_EXTI15_10,
                   AppExti15_10ISR);

    BSP_IntPrioSet(BSP_INT_ID_EXTI15_10,
                   5u);

    BSP_IntEn(BSP_INT_ID_EXTI15_10);
}

/* ---------------- ISR ---------------- */

static void AppExti15_10ISR(void)
{
    OS_ERR err;

    /* GAS: PF12 / D8 */
    if (EXTI_GetITStatus(GAS_EXTI_LINE) != RESET) {
        EXTI_ClearITPendingBit(GAS_EXTI_LINE);

        OSFlagPost(&AppEmergencyFlags,
                   APP_FLAG_GAS,
                   OS_OPT_POST_FLAG_SET,
                   &err);
    }

    /* FLAME: PF15 / D2 */
    if (EXTI_GetITStatus(FLAME_EXTI_LINE) != RESET) {
        EXTI_ClearITPendingBit(FLAME_EXTI_LINE);

        OSFlagPost(&AppEmergencyFlags,
                   APP_FLAG_FLAME,
                   OS_OPT_POST_FLAG_SET,
                   &err);
    }

    /* PIR: PF14 / D4 */
    if (EXTI_GetITStatus(PIR_EXTI_LINE) != RESET) {
        EXTI_ClearITPendingBit(PIR_EXTI_LINE);

        OSSemPost(&AppPirSem,
                  OS_OPT_POST_1,
                  &err);
    }

    /* Button: PC13 */
    if (EXTI_GetITStatus(BTN_EXTI_LINE) != RESET) {
        EXTI_ClearITPendingBit(BTN_EXTI_LINE);

        OSSemPost(&AppButtonSem,
                  OS_OPT_POST_1,
                  &err);
    }
}

/* ---------------- Event / command helpers ---------------- */
static void AppEventPost(APP_EVENT_TYPE type, CPU_INT32U value)
{
    APP_EVENT *p_event;
    OS_ERR     err;
    CPU_SR_ALLOC();

    CPU_CRITICAL_ENTER();

    p_event = &AppEventPool[AppEventWrIx];

    AppEventWrIx++;
    if (AppEventWrIx >= APP_EVENT_Q_SIZE) {
        AppEventWrIx = 0u;
    }

    p_event->Type  = type;
    p_event->Value = value;

    CPU_CRITICAL_EXIT();

    OSQPost(&AppEventQ,
            p_event,
            sizeof(APP_EVENT),
            OS_OPT_POST_FIFO,
            &err);
}

static void AppCmdParse(CPU_CHAR *line)
{
    if (AppStrEq(line, "help") == DEF_TRUE) {
        AppEventPost(APP_EVENT_CMD_HELP, 0u);
    } else if (AppStrEq(line, "status") == DEF_TRUE) {
        AppEventPost(APP_EVENT_CMD_STATUS, 0u);
    } else if (AppStrEq(line, "out") == DEF_TRUE) {
        AppEventPost(APP_EVENT_REQ_OUT, 0u);
    } else if (AppStrEq(line, "home") == DEF_TRUE) {
        AppEventPost(APP_EVENT_REQ_HOME, 0u);
    } else if (AppStrEq(line, "clear") == DEF_TRUE) {
        AppEventPost(APP_EVENT_REQ_CLEAR, 0u);
    } else {
        AppTrace("[WARN][USART] Unknown command. Type help\r\n");
    }
}

static void AppPrintHelp(void)
{
    AppTrace("[HELP] home | out | clear | status | help\r\n");
}

static void AppPrintStatus(void)
{
    APP_TRACE_DBG(("[MONITOR] mode=%d gas=%lu flame=%lu pir=%lu btn=%lu cmd=%lu\r\n",
                   (int)AppMode,
                   (unsigned long)AppGasCount,
                   (unsigned long)AppFlameCount,
                   (unsigned long)AppPirCount,
                   (unsigned long)AppButtonCount,
                   (unsigned long)AppCommandCount));
}

/* ---------------- Output helpers ---------------- */
static void AppApplyOutputs(void)
{
    if (AppMode == APP_MODE_HOME) {
        /*
         * HOME:
         * Power normal, Gas normal
         */
        GPIO_ResetBits(POWER_LED_GPIO_PORT, POWER_LED_CUT_RED_PIN);
        GPIO_SetBits  (POWER_LED_GPIO_PORT, POWER_LED_NORMAL_GREEN_PIN);

        GPIO_ResetBits(GAS_LED_GPIO_PORT, GAS_LED_CUT_RED_PIN);
        GPIO_SetBits  (GAS_LED_GPIO_PORT, GAS_LED_NORMAL_GREEN_PIN);

        GPIO_ResetBits(BUZZER_GPIO_PORT, BUZZER_GPIO_PIN);
        AppServoSetAngle(0u);

    } else if (AppMode == APP_MODE_OUT) {
        /*
         * OUT:
         * Power cut, Gas normal
         */
        GPIO_SetBits  (POWER_LED_GPIO_PORT, POWER_LED_CUT_RED_PIN);
        GPIO_ResetBits(POWER_LED_GPIO_PORT, POWER_LED_NORMAL_GREEN_PIN);

        GPIO_ResetBits(GAS_LED_GPIO_PORT, GAS_LED_CUT_RED_PIN);
        GPIO_SetBits  (GAS_LED_GPIO_PORT, GAS_LED_NORMAL_GREEN_PIN);

        GPIO_ResetBits(BUZZER_GPIO_PORT, BUZZER_GPIO_PIN);
        AppServoSetAngle(0u);

    } else {
        /*
         * EMERGENCY initial output.
         * Continuous emergency output is handled by AppTaskOutput().
         */
        GPIO_SetBits  (POWER_LED_GPIO_PORT, POWER_LED_CUT_RED_PIN);
        GPIO_ResetBits(POWER_LED_GPIO_PORT, POWER_LED_NORMAL_GREEN_PIN);

        GPIO_SetBits(BUZZER_GPIO_PORT, BUZZER_GPIO_PIN);

        if (AppEmergencyReason == APP_EMG_GAS) {
            GPIO_SetBits  (GAS_LED_GPIO_PORT, GAS_LED_CUT_RED_PIN);
            GPIO_ResetBits(GAS_LED_GPIO_PORT, GAS_LED_NORMAL_GREEN_PIN);
            AppServoSetAngle(0u);

        } else if (AppEmergencyReason == APP_EMG_FLAME) {
            GPIO_ResetBits(GAS_LED_GPIO_PORT, GAS_LED_CUT_RED_PIN);
            GPIO_SetBits  (GAS_LED_GPIO_PORT, GAS_LED_NORMAL_GREEN_PIN);
            AppServoSetAngle(90u);

        } else {
            GPIO_ResetBits(GAS_LED_GPIO_PORT, GAS_LED_CUT_RED_PIN);
            GPIO_SetBits  (GAS_LED_GPIO_PORT, GAS_LED_NORMAL_GREEN_PIN);
            AppServoSetAngle(0u);
        }
    }
}

static void AppServoSetAngle(CPU_INT08U degree)
{
	CPU_INT16U pulse_us;

	    pulse_us = 1000u + ((CPU_INT16U)degree * 1000u / 180u);

